# FlowState Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Pipe..::..FlowState Property
Pipe Class See Also
---
The flow state of the pipe.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PipeFlowState FlowState { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FlowState As PipeFlowState
	Get
```

Visual C++
---
```text
public:
property PipeFlowState FlowState {
	PipeFlowState get ();
}
```

# See Also
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace